package HomeWork;
import java.io.*;

public class MassivMiddle {

    // Вывести в консоль половину массива, среднеарифметическое которых является наибольшим

    public static void main(String[] args) throws IOException {


        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        System.out.println("Введите четное положительное число: ");
        String s = br.readLine();
        int x=Integer.parseInt(s);
        int[] mas = new int[];
    }
}
